#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	//有符号位和无符号位是在内存中看补码
	char a = -1;
	//1111 1111  有符号位的char 高位补1
	//1111 1111 1111 1111 1111 1111 1111 1111  补码
	//1111 1111 1111 1111 1111 1111 1111 1110  反码
	//1000 0000 0000 0000 0000 0000 0000 0001  原码
	//-1
	signed char b = -1;
	//1111 1111  有符号位的char 高位补1
	//1111 1111 1111 1111 1111 1111 1111 1111  补码
	//1111 1111 1111 1111 1111 1111 1111 1110  反码
	//1000 0000 0000 0000 0000 0000 0000 0001  原码
	//-1
	unsigned char c = -1;
	//1111 1111  无符号位的char 高位补0
	//0000 0000 0000 0000 0000 0000 1111 1111  补码
	//补码即原码  255

	char d = -128;
	//1000 0000 0000 0000 0000 0000 1000 0000  char有符号位高位补1
	//1111 1111 1111 1111 1111 1111 0111 1111  反码
	//1111 1111 1111 1111 1111 1111 1000 0000  补码
	//1000 0000  只能存8位-->整形提升
	//1111 1111 1111 1111 1111 1111 1000 0000  高位补1
	//无符号输出  补码即原码
	printf("d=%u\n", d);

	char e = 128;
	//0000 0000 0000 0000 0000 0000 1000 0000
	//1000 0000 -->整形提升
	//1111 1111 1111 1111 1111 1111 1000 0000
	printf("e=%u\n", e);

	printf("a=%d b=%d c=%d\n", a, b, c);
	return 0;
}

//int main()
//{
//	int a = 1;
//	int* p = &a;
//	printf("%p\n", p);
//	printf("%d\n", sizeof(p));//4
//	printf("%d\n", sizeof(*(char*)p));//1
//	printf("%d\n", sizeof(* p));//4
//
//	/*printf("%d\n", sizeof(int*));
//	printf("%d\n", sizeof(char*));
//	printf("%d\n", sizeof(short*));
//	printf("%d\n", sizeof(int*));
//	printf("%d\n", sizeof(int*));*/
//
//
//	return 0;
//}